[
  {
    "Id": "110350cb-49a6-4b41-ade1-afc4dcdb7460",
    "Description": "",
    "PersonId": "fa9be753-5e2f-4cf3-9844-bf8102984dc8"
  },
  {
    "Id": "094dd76e-a0bf-4957-b18b-fe8db3e0d534",
    "Description": "",
    "PersonId": "7ee34dab-cfee-4082-bdf0-4ed6fbf9b522"
  },
  {
    "Id": "a59311cc-8c11-4cea-9bc2-9d737ee42308",
    "Description": "",
    "PersonId": "fc4fff57-2ab6-4c5b-ad3e-27f4a6dbb1dd"
  },
  {
    "Id": "dea7d24b-d19b-4101-a8db-bca65b312fa6",
    "Description": "<strong>David Tielke</strong> ist Softwareentwickler bei der Firma uniserve GmbH und entwickelt dort Videomanagementlösungen im Logistikbereich auf Basis von .NET und dem SQL Server. Seit 2008 ist er außerdem ein Microsoft Student Partner und vermittelt in Workshops sein Wissen über Microsoftprodukte an Studierende der Hochschulen in ganz Deutschland oder bei Veranstaltungen wie zum Beispiel den dotnetpro powerdays. Darüber hinaus ist er Microsoft Certified Professional (MCP) für die Entwicklung mit dem .NET-Framework und hat sich während seines Studiums an der Philipps-Universität in Marburg im Bereich Softwaretechnik und Computer Vision spezialisiert.",
    "PersonId": "3c38d948-9fce-4e5e-a3f1-49100a4ff141"
  },
  {
    "Id": "e0519088-bacd-4e8d-bc1c-b3e7be0650f1",
    "Description": "<strong>Thomas Claudius Huber</strong> ist Senior Consultant bei der Trivadis AG in Basel. Als Trainer, Berater und Entwickler ist er in den Bereichen .NET, Java und PL/SQL tätig. Da ihn Benutzeroberflächen schon seit seinem Informatik-Studium begeisterten, spezialisierte er sich in den vergangenen Jahren auf die UI-Programmierung mit WPF und Silverlight. Er ist Autor des umfassenden Handbuchs zur Windows Presentation Foundation und des umfassenden Handbuchs zu Silverlight. Seine persönliche Seite finden Sie unter http://www.thomasclaudiushuber.com",
    "PersonId": "02c5cec1-199a-4559-8e70-2cd127f25da5"
  },
  {
    "Id": "1de84e77-4833-46b9-89f5-3034aee89581",
    "Description": "<strong>Thomas Schissler</strong> arbeitet als Projektleiter, Software-Architekt und Coach bei der artiso AG nahe Ulm und beschäftigt sich seit 2001 mit der Software-Entwicklung auf Basis von .NET. Er ist MVP für Team System und Group-Leiter der .net Dveloper-Group Ulm (www.dotnet-ulm.de) und der internationalen Visual Studio ALM User Group (www.vsalmug.com). Er hat sich auf die Themen Team Foundation Server, Moderne Architekturkonzepte, Prozessdesign und Qualitätsmanagement spezialisiert. In diversen Vorträgen gibt er praxisorientierte Tipps an Entscheider und Entwickler weiter. Er bloggt so oft wie möglich unter www.artiso.com/problog.",
    "PersonId": "94b9b51a-d77c-40e6-981e-7596d2c096a9"
  },
  {
    "Id": "2020c264-60fe-437f-b1d6-7f7676bb395f",
    "Description": "<strong>Ilker Cetinkaya</strong>, Berater, Architekt und Entwickler bei Avanade Deutschland GmbH, entwickelt Software mit dem Microsoft .NET Framework seit der Version 1.0. Durch sein langjähriges Wirken bei großen Projekten prägt ihn ein breites & tiefes Know-How, besonders in den Themen Skalierung, Performance und Flexibilität von .NET Anwendungen; sowohl im Web- als auch im Enterprise-Umfeld. Als ausgewiesener Experte für professionelle Software-Entwicklung beschäftigt er sich seit mehreren Jahren intensiv mit den Themen agile Methoden, TDD / BDD, C# 3.0 / 4.0 und Software-Design.",
    "PersonId": "a9fda06a-3ecf-4990-8f26-93b992e6cbb2"
  },
  {
    "Id": "64329cd2-a317-4047-a95d-d10920c127e2",
    "Description": "<strong>Ralf Westphal</strong> (www.ralfw.de) ist freiberuflicher Berater, Projektbegleiter und Trainer für Themen rund um .NET Softwarearchitektur. Er ist Autor von mehr als 450 Publikationen und Microsoft Most Valued Professional. Mit Stefan Lieser hat er die Initiative „Clean Code Developer“ für mehr Softwarequalität ins Leben gerufen (www.clean-code-developer.de).",
    "PersonId": "2b7c3ee3-078c-4498-93a1-9172b77c7b5f"
  },
  {
    "Id": "9e9ff995-1352-4066-bcf4-c544300edc46",
    "Description": "<strong>Urs Enzler</strong> hat an der ETH Zürich Informatik studiert. Neben seiner Haupttätigkeit als Softwarearchitekt bei bbv Software Services AG (www.bbv.ch) unterstützt er Unternehmen bei der Einführung agiler Entwicklungsmethoden wie Scrum oder Test-driven Development. Er referiert auf Konferenzen und Tagungen in der Schweiz und in Deutschland über agile Softwareentwicklung und -architektur. Er bloggt auf http://www.planetgeek.ch.",
    "PersonId": "7ff11922-ca1e-4d7d-9eb7-9944ae042771"
  },
  {
    "Id": "ca277463-b8fc-4a55-bf96-bb64d9beca84",
    "Description": "<strong>Daniel Marbach</strong> ist ein enthusiastischer Senior Software Engineer bei bbv Software Services AG in Luzern. Seine Erfahrung reicht über Mobile Applikationsentwicklung bis zu Client und Server Entwicklung mit einer starken Tendenz zu Verteilten Systemen. Daniel hat ein Abschluss als Dipl. Inf. Ing. FH von der Fachhochschule für Technik und Architektur in Horw. \r\n\r\nDaniel hat Stärken in Agilen Entwicklungsmethodiken wie Continuous Integration und Test Driven Development. Er ist ein regelmässiger Sprecher, Coach und passionierter Blogschreiber auf http://www.planetgeek.ch. Er ist der Co-Gründer der .NET Usergroup Zentralschweiz und auf einer immerwährenden Reise als Software Entwickler mit Überzeugung und Engagement.",
    "PersonId": "0b15d9f7-d5f2-4655-bd8b-8a1b0ec5e58d"
  },
  {
    "Id": "e9616633-ba26-4e46-bfb3-86d266f4b374",
    "Description": "<strong>Jürgen Gutsch</strong> ist Geschäftsführer, Softwareentwickler, Trainer und Berater bei der GUTSCH-ONLINE Software GmbH. Neben Familie und Beruf ist Jürgen Leiter des <strong>.NET-Stammtisch Konstanz-Kreuzlingen</strong> und betreibt ein Blog auf ASP.NET Zone zum Thema <strong>ASP.NET und mehr...</strong> Sie erreichen ihn über seinen Blog oder über juergen.gutsch@dotnetkk.de.",
    "PersonId": "a999207e-dc5e-4d37-b3c2-b638ea9506c2"
  },
  {
    "Id": "a09eb765-a189-4f0d-a597-4a3b1fe7865a",
    "Description": "<strong>Thorsten Hans</strong> arbeitet als Teamlead .NET Development bei der Firma Data One in Saarbrücken. Er ist mehrfach als MCTS und MCPD zertifiziert und beschäftigt sich neben SharePoint und .NET Enterprise Entwicklung mit IronRuby, MSBuild und WF4. \r\nSie erreichen Ihn über einen seiner Blogs http://www.ironruby-rocks.com, http://www.dotnet-rocks.de oder via Email unter thorsten.hans@gmail.com.",
    "PersonId": "e7ac92c5-8411-43ab-a662-ddaa0c4eab08"
  },
  {
    "Id": "9036a574-0e35-4efc-9cac-be22710e16c3",
    "Description": "<strong>Golo Roden</strong> ist freiberuflicher Wissensvermittler und Technologieberater für .NET, Codequalität und agile Methoden. Zu diesen Themen berät er Firmen bei der Evaluierung, Erforschung und Verwendung geeigneter Technologien und Methoden. Darüber hinaus ist er journalistisch für Fachzeitschriften und als Referent und Content Manager für Konferenzen tätig. Für sein qualitativ hochwertiges Engagement in der Community wurde Golo von Microsoft als Most Valuable Professional (MVP) für C# ausgezeichnet.",
    "PersonId": "16530f27-e08b-4f15-b5c0-5467203f0325"
  },
  {
    "Id": "cb1584f1-9ef9-4189-b2dd-3590b38c3dc6",
    "Description": "<strong>Roberto Danti</strong> ist begeisterter .NET-Entwickler und Senjor Software Developer bei der GUTSCH-ONLINE Software GmbH in Engen.",
    "PersonId": "65ccda37-01a7-4e24-bca9-b16486dbf0e7"
  },
  {
    "Id": "07b783d5-acac-419f-99c1-9067783c85b0",
    "Description": "<strong>Gregor Biswanger</strong> ist Microsoft MVP für Client App Dev und Arbeitet als Solution Architect und Silverlight Experte bei der Firma impuls Informationsmanagement GmbH aus Nürnberg. Seine Schwerpunkte liegen im Bereich der .NET-Architektur, XAML und agilen Prozessen. \r\n\r\nGregor ist auch freier Autor, Speaker und Microsoft CLIPler der INdotNET (Ingolstädter .NET Developers Group).",
    "PersonId": "d0605bdb-cebf-444b-8c0e-ea049f42dcc3"
  },
  {
    "Id": "6ed00721-f4d7-4b95-bc02-18a01b29e116",
    "Description": "Constantin arbeitet als Anwendungsarchitekt und Entwickler bei der Freudenberg Forschungsdienste KG. Dort beschäftigt er sich hauptsächlich mit dem Design und der Entwicklung von Web-Informationssystemen und Datenbanken. Seit seinem Studium der Wirtschaftsinformatik gilt sein besonderes Interesse darüber hinaus allen aktuellen Themen im Microsoft .NET Umfeld, insbesondere aber dem Thema Softwarearchitektur. \r\n\r\nEr ist MCSD, MCITP Database Developer und MCPD Web + Enterprise Application Developer. 2010 und 2011 wurde er von Microsoft zum Most Valuable Professional (MVP) für SQL Server ernannt. \r\n\r\nEr engagiert sich zusätzlich im Vorstand des Just Community e.V. (<a href=\"http://www.justcommunity.de\">http://www.justcommunity.de</a>) und als Leiter der .NET User Group Frankfurt (<a href=\"http://www.dotnet-ug-frankfurt.de\">http://www.dotnet-ug-frankfurt.de</a>). Sein Blog finden Sie unter: <a href=\"http://kostjaklein.wordpress.com\">http://kostjaklein.wordpress.com</a>",
    "PersonId": "9f75b5c9-256a-4a47-9ea9-854e3bfe5d01"
  },
  {
    "Id": "a78ce0b2-286a-469f-9dd1-66b86273040b",
    "Description": "Als Softwareentwickler und IT-Berater interessiert sich Dennis Traub besonders für Software Craftmanship, Agile Entwicklungsmethoden und Domain-Driven Design. Mit 20 Jahren Erfahrung in der Softwareentwicklung liegt sein derzeitiger Schwerpunkt auf Web- und Cloud-basierten Geschäftsanwendungen sowie Systemen für Qualitätsmanagement, Risikoanalyse und Sicherheit im Luftverkehr. Er ist regelmäßiger Sprecher auf Konferenzen und Entwicklerevents, Autor und Trainer.\r\n\r\nIn seiner Freizeit steht Dennis bei <a href=\"http://stackoverflow.com/users/158668/dennis-traub\">Stack Overflow</a> und in Usergroups anderen Entwicklern mit Rat und Tat zur Seite. Er ist Moderator der <a href=\"http://online-usergroup.de/\">.Net Online Usergroup</a> und Mitglied der <a href=\"http://www.dotnet-paderborn.de/\">.Net-User Group Paderborn</a>. Er lebt mit seiner Familie in der Nähe von Paderborn. Bei Twitter findet man ihn unter <a href=\"https://twitter.com/DTraub\">@DTraub</a>.",
    "PersonId": "cf59674f-ce8e-4b10-8f29-1d586c44ad57"
  },
  {
    "Id": "C2AEE8B3-5522-4CB1-8057-0ACEEB849B9C",
    "Description": "",
    "PersonId": "D108611B-5C2C-4C90-9011-DA430D823A7F"
  },
  {
    "Id": "2E7674D3-61BF-4629-9D5C-89296CA2247F",
    "Description": "",
    "PersonId": "165B8999-30A5-460A-A689-F6AC4DDD55C7"
  },
  {
    "Id": "0A0F9C43-C71D-4500-A4F7-94D419A09414",
    "Description": "",
    "PersonId": "F07ADC28-6E93-48D0-AA58-91E20F36C864"
  },
  {
    "Id": "154F27BB-7272-4FBA-85F2-54AB1F0BCBE0",
    "Description": "",
    "PersonId": "B7C433A2-27E3-4E7B-AA26-D788E621ADF2"
  }
]